app/Controllers/AdminController.php

    public function dashboard()
{
    if (!session()->get('is_admin')) {
        return redirect()->to('/admin/login');
    }

    $peminjamanModel = new PeminjamanModel();
    $bukuModel = new BukuModel();
    $anggotaModel = new AnggotaModel();
    $kategoriModel = new KategoriModel(); // Tambahkan ini

    $data = [
        'totalBuku' => $bukuModel->countAll(),
        'totalPeminjaman' => $peminjamanModel->countAll(),
        'totalAnggota' => $anggotaModel->countAll(),
        'peminjamanMenunggu' => $peminjamanModel->getPeminjamanMenunggu(),
        'allLoans' => $peminjamanModel->getAllLoans(),
        'books' => $bukuModel->findAll(),
        'members' => $anggotaModel->getAllMembers(),
        'categories' => $kategoriModel->getAllCategories() // Tambahkan ini

    ];
---
SELECT COUNT(*) AS `numrows` FROM `buku`
SELECT COUNT(*) AS `numrows` FROM `peminjaman`
SELECT COUNT(*) AS `numrows` FROM `anggota`
SELECT *
FROM `buku`