app/Controllers/PeminjamanController.php

SELECT *
FROM `buku`
SELECT `peminjaman`.*, `buku`.`judul`, TIMESTAMPDIFF(SECOND, NOW(), batas_waktu) as sisa_waktu
FROM `peminjaman`
JOIN `buku` ON `buku`.`id` = `peminjaman`.`buku_id`
WHERE `anggota_id` = '1'
---
    public function index()
{
    $peminjamanModel = new PeminjamanModel();
    $bukuModel = new BukuModel();

    $anggota_id = session('anggota_id');

    $data['buku'] = $bukuModel->findAll();

    $data['peminjaman'] = $peminjamanModel
        ->select('peminjaman.*, buku.judul,
                 TIMESTAMPDIFF(SECOND, NOW(), batas_waktu) as sisa_waktu')
        ->join('buku', 'buku.id = peminjaman.buku_id')
        ->where('anggota_id', $anggota_id)
        ->findAll();

INSERT INTO `peminjaman` (`anggota_id`, `buku_id`, `waktu_pinjam`, `batas_waktu`, `status`, `created_at`, `updated_at`) VALUES ('1', '2', '2025-05-10 06:52:40', '2025-05-17 06:52:40', 'menunggu', '2025-05-10 06:52:40', '2025-05-10 06:52:40')
---
    public function pinjam()
    {
        $peminjamanModel = new PeminjamanModel();

        // Ambil anggota_id dari session dengan key yang benar
        $anggota_id = session('anggota_id');
        $buku_id = $this->request->getPost('buku_id');

        $now = date('Y-m-d H:i:s');
        $batas = date('Y-m-d H:i:s', strtotime('+7 days'));

        // Simpan data peminjaman ke database
        $peminjamanModel->save([
            'anggota_id'   => $anggota_id,
            'buku_id'      => $buku_id,
            'waktu_pinjam' => $now,
            'batas_waktu'  => $batas,
            'status'       => 'menunggu'
        ]);