app/Models/AnggotaModel.php

    public function getAllMembers()
    {
        return $this->orderBy('nama', 'ASC')->findAll();
---
SELECT *
FROM `anggota`
ORDER BY `nama` ASC