app/Models/KategoriModel.php

    public function getAllCategories()
    {
        if (!$this->db->tableExists($this->table)) {
            return [];
        }
        return $this->orderBy('nama', 'ASC')->findAll();
---
SELECT *
FROM `kategori`
ORDER BY `nama` ASC