app/Models/PeminjamanModel.php

    public function getAllLoans()
    {
        return $this->select('peminjaman.*, anggota.nama, buku.judul, anggota.nim')
                   ->join('anggota', 'anggota.id = peminjaman.anggota_id')
                   ->join('buku', 'buku.id = peminjaman.buku_id')
                   ->orderBy('peminjaman.created_at', 'DESC')
                   ->findAll();
---
SELECT `peminjaman`.*, `anggota`.`nama`, `buku`.`judul`, `anggota`.`nim`
FROM `peminjaman`
JOIN `anggota` ON `anggota`.`id` = `peminjaman`.`anggota_id`
JOIN `buku` ON `buku`.`id` = `peminjaman`.`buku_id`
ORDER BY `peminjaman`.`created_at` DESC

    public function getPeminjamanDetail($id)
    {
    return $this->select('peminjaman.*, buku.judul, anggota.nama as nama_peminjam, anggota.nim')
                ->join('buku', 'buku.id = peminjaman.buku_id')
                ->join('anggota', 'anggota.id = peminjaman.anggota_id')
                ->where('peminjaman.id', $id)
                ->first(); // Gunakan first() bukan find() untuk join query
---
SELECT `peminjaman`.*, `buku`.`judul`, `anggota`.`nama` as `nama_peminjam`, `anggota`.`nim`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id` = `peminjaman`.`buku_id`
JOIN `anggota` ON `anggota`.`id` = `peminjaman`.`anggota_id`
WHERE `peminjaman`.`id` = '6'
 LIMIT 1

    public function getPeminjamanMenunggu($limit = null)
{
    $query = $this->select('peminjaman.*, anggota.nama, buku.judul')
                 ->join('anggota', 'anggota.id = peminjaman.anggota_id')
                 ->join('buku', 'buku.id = peminjaman.buku_id')
                 ->where('status', 'menunggu')
                 ->orderBy('peminjaman.created_at', 'DESC');

    if ($limit) {
        $query->limit($limit);
    }

    return $query->findAll();
---
SELECT `peminjaman`.*, `anggota`.`nama`, `buku`.`judul`
FROM `peminjaman`
JOIN `anggota` ON `anggota`.`id` = `peminjaman`.`anggota_id`
JOIN `buku` ON `buku`.`id` = `peminjaman`.`buku_id`
WHERE `status` = 'menunggu'
ORDER BY `peminjaman`.`created_at` DESC